app/views/home/index.html.erb

SELECT "users".* FROM "users"
---
<h4>All users</h4>
<% User.all.each do |u| %>